artillery-tests/artillery-test-basic.yml
# Artillery Basic HTTP Load Test Configuration
# Created with AI assistance (Claude/Cursor)

config:
  target: "http://localhost:4567"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"
    - duration: 60
      arrivalRate: 3
      name: "Cool down"

scenarios:
  - name: "Browse forum pages"
    flow:
      - get:
          url: "/"
          capture:
            - json: "$.status"
              as: "status"
      - think: 2
      - get:
          url: "/recent"
      - think: 3
      - get:
          url: "/popular"
      - think: 2
      - get:
          url: "/tags"
      - think: 1
      - get:
          url: "/users"